data-asplos/gramine-tyche/lighttpd-10K.txt
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.51ms    1.90ms  56.12ms   95.49%
    Req/Sec     0.93k    72.39     4.28k    89.10%
  1332166 requests in 2.00m, 12.97GB read
Requests/sec:  11093.01
Transfer/sec:    110.64MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.53ms    1.84ms  57.48ms   95.44%
    Req/Sec     0.93k    80.75     3.35k    84.58%
  1331675 requests in 2.00m, 12.97GB read
Requests/sec:  11090.61
Transfer/sec:    110.61MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.52ms    1.92ms  50.98ms   94.64%
    Req/Sec     0.93k    95.35     3.47k    84.20%
  1332218 requests in 2.00m, 12.98GB read
Requests/sec:  11092.81
Transfer/sec:    110.63MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.52ms    1.93ms  53.77ms   96.02%
    Req/Sec     0.93k    85.04     4.22k    85.84%
  1332080 requests in 2.00m, 12.97GB read
Requests/sec:  11092.03
Transfer/sec:    110.63MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.51ms    1.89ms  56.53ms   95.45%
    Req/Sec     0.93k    74.65     4.57k    90.48%
  1332139 requests in 2.00m, 12.97GB read
Requests/sec:  11092.52
Transfer/sec:    110.63MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.53ms    2.12ms  61.69ms   94.88%
    Req/Sec     0.93k    93.27     1.68k    82.12%
  1331383 requests in 2.00m, 12.97GB read
Requests/sec:  11089.83
Transfer/sec:    110.61MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.51ms    1.86ms  54.74ms   95.47%
    Req/Sec     0.93k    73.11     5.03k    90.09%
  1332285 requests in 2.00m, 12.98GB read
Requests/sec:  11093.57
Transfer/sec:    110.64MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.51ms    1.85ms  57.14ms   95.84%
    Req/Sec     0.93k    67.47     4.55k    87.61%
  1332243 requests in 2.00m, 12.98GB read
Requests/sec:  11093.20
Transfer/sec:    110.64MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.53ms    2.15ms 124.09ms   95.18%
    Req/Sec     0.93k    91.78     1.76k    82.52%
  1331929 requests in 2.00m, 12.97GB read
Requests/sec:  11090.68
Transfer/sec:    110.61MB
Running 2m test @ http://128.178.116.130:8000/random/10K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    35.52ms    1.94ms  53.14ms   95.68%
    Req/Sec     0.93k    81.48     4.16k    86.91%
  1332025 requests in 2.00m, 12.97GB read
Requests/sec:  11091.06
Transfer/sec:    110.62MB